Revit 2027 API
Family Properties
The Family type exposes the following members.
Properties
Name | Description
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
CurtainPanelHorizontalSpacing |  For Curtain Panel families, the horizontal spacing of the driving mesh.
CurtainPanelTilePattern |  For Curtain Panel families, the choice of tile pattern.
CurtainPanelVerticalSpacing |  For Curtain Panel families, the vertical spacing of the driving mesh.
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
Document | Returns the Document in which the Element resides.
(Inherited from Element)
FamilyCategory | Retrieves or sets a Category object that represents the category or sub category in which the elements ( this family could generate ) reside.
FamilyCategoryId |  The id of the category or sub category in which the elements that this family could generate reside.
FamilyPlacementType |  Identifies the type of placement required by a given family.
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsConceptualMassFamily |  Whether the Family is a Conceptual Mass family.
IsCurtainPanelFamily |  Whether the Family is a Curtain Panel family. Curtain Panel family symbols are used as the ObjectTypes of DividedSurface elements.
IsEditable |  True if the family supports editing, false otherwise.
IsInPlace |  True if the family is an in-place family, false if the family is a loadable family.
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsOwnerFamily |  True if the family is the owner family for its own editable document, false otherwise.
IsParametric |  Identifies whether the family contains parametric relations between some of its elements.
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsUserCreated |  Determine whether the family has been defined by the user.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
LevelId |  The id of the level associated with the element.
(Inherited from Element)
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
Name | A human readable name for the Element.
(Inherited from Element)
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
ShowSpatialElementCalculationPoint |  For families that can have a calculation point for spatial elements, hide or show the calculation point. SpatialElementCalculationPoint elements.
StructuralCodeName |  The family's structural code name.
StructuralFamilyNameKey |  The family's structural section shape name key.
StructuralMaterialType |  The family's structural material type.
StructuralSectionShape |  The family's structural section shape.
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace